Revit 2027 API
Definitions.IsEmpty Property
Identifies if the definitions collection is empty.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEmpty { get; }
Public ReadOnly Property IsEmpty As Boolean
	Get
public:
property bool IsEmpty {
	bool get ();
}
member IsEmpty : bool with get
Property Value
Boolean
See Also
Reference
Definitions Class
Autodesk.Revit.DB Namespace